###################################################################

# Created by write_sdc on Thu Nov 20 21:13:49 2014

###################################################################
set sdc_version 1.9

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_driving_cell -lib_cell INVX4 -library Lib6710_08 [get_ports clk]
set_driving_cell -lib_cell INVX4 -library Lib6710_08 [get_ports reset]
set_driving_cell -lib_cell INVX4 -library Lib6710_08 [get_ports {op[5]}]
set_driving_cell -lib_cell INVX4 -library Lib6710_08 [get_ports {op[4]}]
set_driving_cell -lib_cell INVX4 -library Lib6710_08 [get_ports {op[3]}]
set_driving_cell -lib_cell INVX4 -library Lib6710_08 [get_ports {op[2]}]
set_driving_cell -lib_cell INVX4 -library Lib6710_08 [get_ports {op[1]}]
set_driving_cell -lib_cell INVX4 -library Lib6710_08 [get_ports {op[0]}]
set_driving_cell -lib_cell INVX4 -library Lib6710_08 [get_ports zero]
set_load -pin_load 0 [get_ports memread]
set_load -pin_load 0 [get_ports memwrite]
set_load -pin_load 0 [get_ports alusrca]
set_load -pin_load 0 [get_ports memtoreg]
set_load -pin_load 0 [get_ports iord]
set_load -pin_load 0 [get_ports pcen]
set_load -pin_load 0 [get_ports regwrite]
set_load -pin_load 0 [get_ports regdst]
set_load -pin_load 0 [get_ports {pcsource[1]}]
set_load -pin_load 0 [get_ports {pcsource[0]}]
set_load -pin_load 0 [get_ports {alusrcb[1]}]
set_load -pin_load 0 [get_ports {alusrcb[0]}]
set_load -pin_load 0 [get_ports {aluop[1]}]
set_load -pin_load 0 [get_ports {aluop[0]}]
set_load -pin_load 0 [get_ports {irwrite[3]}]
set_load -pin_load 0 [get_ports {irwrite[2]}]
set_load -pin_load 0 [get_ports {irwrite[1]}]
set_load -pin_load 0 [get_ports {irwrite[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_input_delay -clock clk  0.25  [get_ports clk]
set_input_delay -clock clk  0.25  [get_ports reset]
set_input_delay -clock clk  0.25  [get_ports {op[5]}]
set_input_delay -clock clk  0.25  [get_ports {op[4]}]
set_input_delay -clock clk  0.25  [get_ports {op[3]}]
set_input_delay -clock clk  0.25  [get_ports {op[2]}]
set_input_delay -clock clk  0.25  [get_ports {op[1]}]
set_input_delay -clock clk  0.25  [get_ports {op[0]}]
set_input_delay -clock clk  0.25  [get_ports zero]
set_output_delay -clock clk  0.25  [get_ports memread]
set_output_delay -clock clk  0.25  [get_ports memwrite]
set_output_delay -clock clk  0.25  [get_ports alusrca]
set_output_delay -clock clk  0.25  [get_ports memtoreg]
set_output_delay -clock clk  0.25  [get_ports iord]
set_output_delay -clock clk  0.25  [get_ports pcen]
set_output_delay -clock clk  0.25  [get_ports regwrite]
set_output_delay -clock clk  0.25  [get_ports regdst]
set_output_delay -clock clk  0.25  [get_ports {pcsource[1]}]
set_output_delay -clock clk  0.25  [get_ports {pcsource[0]}]
set_output_delay -clock clk  0.25  [get_ports {alusrcb[1]}]
set_output_delay -clock clk  0.25  [get_ports {alusrcb[0]}]
set_output_delay -clock clk  0.25  [get_ports {aluop[1]}]
set_output_delay -clock clk  0.25  [get_ports {aluop[0]}]
set_output_delay -clock clk  0.25  [get_ports {irwrite[3]}]
set_output_delay -clock clk  0.25  [get_ports {irwrite[2]}]
set_output_delay -clock clk  0.25  [get_ports {irwrite[1]}]
set_output_delay -clock clk  0.25  [get_ports {irwrite[0]}]
